FROM node:20-alpine AS build

WORKDIR /app

COPY app/package*.json ./ 

RUN npm install --production

COPY app/index.js ./

USER node

EXPOSE 80

CMD ["node", "index.js"]

#сделали в два слоя copy потомучот докер при изменении кода(даже 1 символ), соотвественно измениене всего хэша слоя не перебилжеал зависимости, ведь они бы находились в одном слое и так бы больше ресурсвов уходило на перебилживание слоя, а в этом случае у нас зависимости и код на разных слоях и докер будет их перебилживать отдельно. 